src/Documents/ДвижениеМногооборотнойТары/ДвижениеМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДвижениеМногооборотнойТары</name>
  <basedOn>Document.МаршрутныйЛист</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыДвиженийМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.МаршрутныйЛист</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительПолучатель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Грузополучатели</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаВодителя</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>МногооборотнаяТара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Хозрасчетный</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <chartOfAccounts>Checked</chartOfAccounts>
    <correspondence>Checked</correspondence>
  </extension>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
    <balance>true</balance>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:AccountingRegister>

src/AccumulationRegisters/ТранспортнаяЛогистикаДоставка/ТранспортнаяЛогистикаДоставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТранспортнаяЛогистикаДоставка</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тоннаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЛогистикиОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВРейсе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.Доверенность</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/Базар_ВидыДвиженийМногооборотнойТары/Базар_ВидыДвиженийМногооборотнойТары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыДвиженийМногооборотнойТары</name>
  <enumValues>
    <name>Передача</name>
  </enumValues>
  <enumValues>
    <name>Прием</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
</mdclass:Enum>

src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <registerRecords>AccumulationRegister.ТранспортнаяЛогистикаДоставка</registerRecords>
  <attributes>
    <name>ДокументЛогистики</name>
    <type>
      <types>DocumentRef.ТранспортнаяЛогистика</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>CatalogRef.Маршруты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Пробег</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Рейсы</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РейсПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставыРейсов</name>
    <attributes>
      <name>Рейс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерВРейсе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресJSON</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыМаршрута</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.Доверенность</types>
        <types>DocumentRef.СчетНаОплатуПокупателю</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Тоннаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Маршруты/Маршруты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Маршруты</name>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокДвижения</name>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ДвижениеМногооборотнойТары/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача")
	 ИЛИ ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Прием") Тогда
		
		ПроверяемыеРеквизиты.Добавить("Водитель");
		ПроверяемыеРеквизиты.Добавить("Автомобиль");
		
		Если ЗначениеЗаполнено(ДокументОснование) тогда
			ПроверяемыеРеквизиты.Добавить("Маршрут");
		КонецЕсли;
		
		Если НаВодителя.Количество() = 0 И Грузополучатели.Количество() = 0 тогда
			ПроверяемыеРеквизиты.Добавить("НаВодителя");
			ПроверяемыеРеквизиты.Добавить("Грузополучатели");
		КонецЕсли;
		
		Если ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача") тогда
			ПроверяемыеРеквизиты.Добавить("Грузополучатели.Документ");
		КонецЕсли;
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Перемещение") Тогда
		
		ПроверяемыеРеквизиты.Добавить("Водитель");
		ПроверяемыеРеквизиты.Добавить("ВодительПолучатель");
		ПроверяемыеРеквизиты.Добавить("НаВодителя");
		
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику") Тогда
		
		ПроверяемыеРеквизиты.Добавить("Поставщик");
		ПроверяемыеРеквизиты.Добавить("НаВодителя");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ОшибкиПроведения = Неопределено;
	
	СчетаМТ = МногооборотнаяТараСервер.СчетаМногооборотнойТары();
	ВидНоменклатурыТары = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара");
	
	Если НЕ МногооборотнаяТараСервер.ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаМТ) тогда
		ТекстСообщения = "Перед началом проведения документа, необходимо в " +
		                 "настройках установить предопределенные значения " +
		                 "счетов учета многооборотной тары:
		                 |     1. ""Многооборотная тара (остатки)"", с кодом: ""МногооборотнаяТараОстатки"";
		                 |     2. ""Задолженность многооборотной тары перед поставщиками"", с кодом: ""МногооборотнаяТараПоставщики"";
		                 |     3. ""Задолженность многооборотной тары водителями-экспедиторами"", с кодом: ""МногооборотнаяТараВодители"";
		                 |     4. ""Задолженность многооборотной тары контрагентами"", с кодом: ""МногооборотнаяТараКонтрагенты"".";
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			ОшибкиПроведения,
			"Номер",
			ТекстСообщения,
			Неопределено
		);
		
	КонецЕсли;
	
	Если НЕ МногооборотнаяТараСервер.ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаМТ) тогда
		
		ТекстСообщения = "Перед началом проведения документа, необходимо в "+
		                 "настройках расширения установить ""Счет учета "+
		                 "многооборотной тары ""!";
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
			ОшибкиПроведения,
			"Номер",
			ТекстСообщения,
			Неопределено
		);
		
	КонецЕсли;
	
	// Подготовка таблицы остатков тары у водителя-экспедитора
	Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Перемещение тогда
		
		СчетаЗапасов = Новый Массив;
		СчетаЗапасов.Добавить(СчетаМТ.МногооборотнаяТараВодители);
		
		ВидыСубконто = Новый Массив;
		Для Каждого Субконто Из СчетаМТ.МногооборотнаяТараВодители.ВидыСубконто Цикл
			ВидыСубконто.Добавить(Субконто.ВидСубконто);
		КонецЦикла;
		
		Если Водитель = ВодительПолучатель тогда
			
			ТекстСообщения = "Нельзя производить перемещение многооборотной тары между одним и тем же водителем!";
			
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
				ОшибкиПроведения,
				"Водитель",
				ТекстСообщения,
				Неопределено
			);
			
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаОстатков", Дата);
		Запрос.УстановитьПараметр("Должник"     , Водитель.ФизическоеЛицо);
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
		Запрос.УстановитьПараметр("СчетаЗапасов", СчетаЗапасов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНаСкладе.Организация КАК Организация,
		|	ОстаткиНаСкладе.Субконто2 КАК МногооборотнаяТара,
		|	СУММА(ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстаток, 0)) КАК КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(&ДатаОстатков, Счет В (&СчетаЗапасов), &ВидыСубконто, Субконто1 = &Должник) КАК ОстаткиНаСкладе
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНаСкладе.Организация,
		|	ОстаткиНаСкладе.Субконто2";
		
		ОстаткиТарыУВодителя = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	
	// Подготовка таблицы тары документа "ПоступленияТоваровУслуг"
	Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику
	   И ЗначениеЗаполнено(ДокументОснование)
	   И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
		
		СчетаЗапасов = Новый Массив;
		СчетаЗапасов.Добавить(СчетаМТ.МногооборотнаяТараПоставщики);
		
		НомерСубконтоПоставщика = 1;
		НомерСубконтоДокумента = 1;
		НомерСубконтоМногооборотнаяТара = 1;
		СчетчикСубконто = 0;
		ВидыСубконто = Новый Массив;
		Для Каждого Субконто Из СчетаМТ.МногооборотнаяТараПоставщики.ВидыСубконто Цикл
			
			СчетчикСубконто = СчетчикСубконто + 1;
			
			Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ДокументОснование)) тогда
				НомерСубконтоДокумента = СчетчикСубконто;
			КонецЕсли;
			
			Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(Поставщик)) тогда
				НомерСубконтоПоставщика = СчетчикСубконто;
			КонецЕсли;
			
			Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура")) тогда
				НомерСубконтоМногооборотнаяТара = СчетчикСубконто;
			КонецЕсли;
			
			ВидыСубконто.Добавить(Субконто.ВидСубконто);
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Дата));
		Запрос.УстановитьПараметр("Поставщик"   , Поставщик);
		Запрос.УстановитьПараметр("Документ"    , ДокументОснование.Ссылка);
		Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
		Запрос.УстановитьПараметр("СчетаЗапасов", СчетаЗапасов);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ОстаткиНаСкладе.Организация КАК Организация,
		|	ОстаткиНаСкладе.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК МногооборотнаяТара,
		|	СУММА(ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстатокКт, 0)) КАК КоличествоОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&ДатаОстатков,
		|			Счет В (&СчетаЗапасов),
		|			&ВидыСубконто,
		|			Субконто" + НомерСубконтоПоставщика + " = &Поставщик
		|				И Субконто" + НомерСубконтоДокумента + " = &Документ) КАК ОстаткиНаСкладе
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиНаСкладе.Организация,
		|	ОстаткиНаСкладе.Субконто" + НомерСубконтоМногооборотнаяТара + "";
		
		ОстаткиТарыПоДокументу = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Для Каждого СтрокаНаВодителя Из НаВодителя Цикл
		
		// Проверяем остатки многооборотной тары у водителя-отправителя
		Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Перемещение тогда
			
			Фильтр = Новый Структура;
			Фильтр.Вставить("Организация"       , СтрокаНаВодителя.Организация);
			Фильтр.Вставить("МногооборотнаяТара", СтрокаНаВодителя.МногооборотнаяТара);
			НайденыеСтроки = ОстаткиТарыУВодителя.НайтиСтроки(Фильтр);
			
			Если НайденыеСтроки.Количество() > 0 тогда
				
				Остатки = НайденыеСтроки.Получить(0);
				Если Остатки.КоличествоОстаток < СтрокаНаВодителя.Количество тогда
					
					ТекстСообщения = "У водителя " + Строка(Водитель) +
					                 " остаток задолженности " +
					                 Строка(СтрокаНаВодителя.МногооборотнаяТара) +
					                 " составляет " + Остатки.КоличествоОстаток + " " +
					                 СтрокаНаВодителя.МногооборотнаяТара.ЕдиницаИзмерения +
					                 ", что превышает требуемое количество к перемещению!";
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
						ОшибкиПроведения,
						"Водитель",
						ТекстСообщения,
						Неопределено
					);
					
				КонецЕсли;
			Иначе
				
				ТекстСообщения = "У водителя " + Строка(Водитель) +
				                 " отсутствует остаток тары " +
				                 Строка(СтрокаНаВодителя.МногооборотнаяТара) + "!";
				
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					ОшибкиПроведения,
					"Водитель",
					ТекстСообщения,
					Неопределено
				);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверяем наличие достаточного количества многооборотной тары
		// в документе-основания (ПоступлениеТоваровУслуг)
		Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику
		   И ЗначениеЗаполнено(ДокументОснование)
		   И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
			
			Фильтр = Новый Структура;
			Фильтр.Вставить("Организация"       , СтрокаНаВодителя.Организация);
			Фильтр.Вставить("МногооборотнаяТара", СтрокаНаВодителя.МногооборотнаяТара);
			НайденыеСтроки = ОстаткиТарыПоДокументу.НайтиСтроки(Фильтр);
			
			Если НайденыеСтроки.Количество() > 0 тогда
				
				Остатки = НайденыеСтроки.Получить(0);
				Если Остатки.КоличествоОстаток < СтрокаНаВодителя.Количество тогда
					
					ТекстСообщения = "По документу-основанию " + Строка(ДокументОснование) +
					                 " остаток многооборотной тары " + Строка(СтрокаНаВодителя.МногооборотнаяТара) +
					                 " составляет " + Остатки.КоличествоОстаток + " " +
					                 СтрокаНаВодителя.МногооборотнаяТара.ЕдиницаИзмерения +
					                 ", что превышает требуемое количество к возврату!";
					
					ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
						ОшибкиПроведения,
						"НаВодителя",
						ТекстСообщения,
						Неопределено
					);
					
				КонецЕсли;
			Иначе
				
				ТекстСообщения = "У документа-основанию " + Строка(ДокументОснование) +
				                 " отсутствует остаток тары " +
				                 Строка(СтрокаНаВодителя.МногооборотнаяТара) + "!";
				
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(
					ОшибкиПроведения,
					"НаВодителя",
					ТекстСообщения,
					Неопределено
				);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Проводим документ, если нет ошибок
		Если ОшибкиПроведения = Неопределено тогда
			
			Проводка = Движения.Хозрасчетный.Добавить();
			
			Проводка.Период       = Дата;
			Проводка.Организация  = СтрокаНаВодителя.Организация;
			Проводка.КоличествоДт = СтрокаНаВодителя.Количество;
			Проводка.КоличествоКт = СтрокаНаВодителя.Количество;
			Проводка.Содержание   = Строка(ВидОперации);
			
			Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Передача тогда
				Проводка.СчетДт = СчетаМТ.МногооборотнаяТараВодители;
				Проводка.СчетКт = СчетаМТ.МногооборотнаяТараОстатки;
				
			ИначеЕсли ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Прием тогда
				Проводка.СчетДт     = СчетаМТ.МногооборотнаяТараОстатки;
				Проводка.СчетКт     = СчетаМТ.МногооборотнаяТараВодители;
				
			ИначеЕсли ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Перемещение тогда
				Проводка.СчетДт     = СчетаМТ.МногооборотнаяТараВодители;
				Проводка.СчетКт     = СчетаМТ.МногооборотнаяТараВодители;
				
			ИначеЕсли ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику тогда
				Проводка.СчетДт     = СчетаМТ.МногооборотнаяТараПоставщики;
				Проводка.СчетКт     = СчетаМТ.МногооборотнаяТараОстатки;
				
			КонецЕсли;
			
			ЗначенияСубконто = Новый Массив;
			ЗначенияСубконто.Добавить(СтрокаНаВодителя.МногооборотнаяТара);
			
			Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Перемещение тогда
				
				ЗначенияСубконто.Добавить(Водитель.ФизическоеЛицо);
				
				Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
					Проводка.СчетКт,
					Проводка.СубконтоКт,
					ЗначенияСубконто
				);
				
				ЗначенияСубконто.Удалить(0);
				ЗначенияСубконто.Добавить(ВодительПолучатель.ФизическоеЛицо);
				
				Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
					Проводка.СчетДт,
					Проводка.СубконтоДт,
					ЗначенияСубконто
				);
				
			Иначе // Передача, Прием, ВозвратПоставщику
				
				Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику тогда
					ЗначенияСубконто.Добавить(Поставщик);
					Если ЗначениеЗаполнено(ДокументОснование) тогда
						ЗначенияСубконто.Добавить(ДокументОснование.Ссылка);
					КонецЕсли;
				Иначе // Передача, Прием
					ЗначенияСубконто.Добавить(Водитель.ФизическоеЛицо);
				КонецЕсли;
				
				Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
					Проводка.СчетДт,
					Проводка.СубконтоДт,
					ЗначенияСубконто
				);
				
				Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
					Проводка.СчетКт,
					Проводка.СубконтоКт,
					ЗначенияСубконто
				);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаГрузополучатель Из Грузополучатели Цикл
		
		// Проводим документ, если нет ошибок
		Если ОшибкиПроведения = Неопределено тогда
			
			Проводка = Движения.Хозрасчетный.Добавить();

			Проводка.Период       = Дата;
			Проводка.Организация  = СтрокаГрузополучатель.Организация;
			Проводка.КоличествоДт = СтрокаГрузополучатель.Количество;
			Проводка.КоличествоКт = СтрокаГрузополучатель.Количество;
			Проводка.Содержание   = Строка(ВидОперации);
			
			Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Передача тогда
				Проводка.СчетДт = СчетаМТ.МногооборотнаяТараКонтрагенты;
				Проводка.СчетКт = СчетаМТ.МногооборотнаяТараОстатки;
				
			ИначеЕсли ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Прием тогда
				Проводка.СчетДт     = СчетаМТ.МногооборотнаяТараОстатки;
				Проводка.СчетКт     = СчетаМТ.МногооборотнаяТараКонтрагенты;
				
			КонецЕсли;
			
			ЗначенияСубконто = Новый Массив;
			ЗначенияСубконто.Добавить(СтрокаГрузополучатель.Грузополучатель);
			ЗначенияСубконто.Добавить(СтрокаГрузополучатель.МногооборотнаяТара);
			ЗначенияСубконто.Добавить(СтрокаГрузополучатель.Документ);
			
			Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
				Проводка.СчетДт,
				Проводка.СубконтоДт,
				ЗначенияСубконто
			);
			
			Документы.ДвижениеМногооборотнойТары.ЗаполнитьПроводкуЗначениямиСубконто(
				Проводка.СчетКт,
				Проводка.СубконтоКт,
				ЗначенияСубконто
			);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(ОшибкиПроведения, Отказ);
	
	Если НЕ Отказ тогда
		Движения.Хозрасчетный.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.МаршрутныйЛист") тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОснование, "Дата, Маршрут, Автомобиль, Водитель");
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
			Поставщик = ДокументОснование.Контрагент;
		КонецЕсли;

	КонецЕсли;
	
	ФиксированноеВремяДокументов.УстановитьВремяНовогоДокумента(ЭтотОбъект, Ложь);
	ЗаполнитьТабличныеЧасти();
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧасти(ЗаполнитьТаблицуНаВодителя = Истина, ЗаполнитьТаблицуГрузополучетели = Истина) Экспорт
	
	Если НЕ ЗаполнитьТаблицуНаВодителя И НЕ ЗаполнитьТаблицуГрузополучетели тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.МаршрутныйЛист") тогда
		ЗаполнитьТабличныеЧастиНаОснованииМаршрутногоЛиста(ЗаполнитьТаблицуНаВодителя, ЗаполнитьТаблицуГрузополучетели);
		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
		ЗаполнитьТабличныеЧастиНаОснованииПоступленияТоваров();
		
	КонецЕСли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиНаОснованииМаршрутногоЛиста(ЗаполнитьТаблицуНаВодителя, ЗаполнитьТаблицуГрузополучетели)
	
	ВидНоменклатурыТары = ПредопределенныеЭлементыРасширенияСервер.ПредопределенноеЗначениеРасширения("Справочник", "ВидыНоменклатуры", "МногооборотнаяТара");
	
	Если НЕ ЗначениеЗаполнено(Маршрут) ИЛИ
		 НЕ ЗначениеЗаполнено(Водитель) ИЛИ
		 НЕ ЗначениеЗаполнено(Автомобиль) ИЛИ
		 НЕ ЗначениеЗаполнено(ВидНоменклатурыТары) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата"               , Дата);
	Запрос.УстановитьПараметр("Маршрут"            , Маршрут);
	Запрос.УстановитьПараметр("Водитель"           , Водитель);
	Запрос.УстановитьПараметр("Автомобиль"         , Автомобиль);
	Запрос.УстановитьПараметр("ВидНоменклатурыТары", ВидНоменклатурыТары);
	Запрос.УстановитьПараметр("ВидОперации"        , ВидОперации);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НоменклатураМногооборотнаяТара.Ссылка КАК МногооборотнаяТара,
	|	НоменклатураМногооборотнаяТара.Номенклатура КАК Номенклатура,
	|	НоменклатураМногооборотнаяТара.КоличествоВМесте КАК КоличествоВМесте
	|ПОМЕСТИТЬ ВТ_КоличествоВМесте
	|ИЗ
	|	Справочник.Номенклатура.МногооборотнаяТара КАК НоменклатураМногооборотнаяТара
	|ГДЕ
	|	НоменклатураМногооборотнаяТара.Ссылка.ВидНоменклатуры = &ВидНоменклатурыТары
	|
	|СГРУППИРОВАТЬ ПО
	|	НоменклатураМногооборотнаяТара.Номенклатура,
	|	НоменклатураМногооборотнаяТара.КоличествоВМесте,
	|	НоменклатураМногооборотнаяТара.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТранспортнаяЛогистикаДоставкаОбороты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача)
	|			ТОГДА ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	КОНЕЦ КАК Документ,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ТочкаМаршрута КАК Грузополучатель,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения.ДоговорКонтрагента.ОбособленныйУчетМногооботнойТары КАК ОбособленныйУчетМногооботнойТары,
	|	ВТ_КоличествоВМесте.МногооборотнаяТара КАК МногооборотнаяТара,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ВТ_КоличествоВМесте.КоличествоВМесте ЕСТЬ NULL
	|					ТОГДА 0
	|				ИНАЧЕ ТранспортнаяЛогистикаДоставкаОбороты.КоличествоРасход / ВТ_КоличествоВМесте.КоличествоВМесте
	|			КОНЕЦ КАК ЧИСЛО(10, 0))) КАК Количество
	|ПОМЕСТИТЬ ВТ_МногооборотнаяТара
	|ИЗ
	|	РегистрНакопления.ТранспортнаяЛогистикаДоставка.Обороты(
	|			НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ),
	|			КОНЕЦПЕРИОДА(&Дата, ДЕНЬ),
	|			День,
	|			Маршрут = &Маршрут
	|				И Водитель = &Водитель
	|				И Автомобиль = &Автомобиль
	|				И ДокументДвижения ССЫЛКА Документ.РеализацияТоваровУслуг
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ВТ_КоличествоВМесте.Номенклатура
	|					ИЗ
	|						ВТ_КоличествоВМесте КАК ВТ_КоличествоВМесте)) КАК ТранспортнаяЛогистикаДоставкаОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоВМесте КАК ВТ_КоличествоВМесте
	|		ПО ТранспортнаяЛогистикаДоставкаОбороты.Номенклатура = ВТ_КоличествоВМесте.Номенклатура
	|ГДЕ
	|	ТранспортнаяЛогистикаДоставкаОбороты.КоличествоРасход > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТранспортнаяЛогистикаДоставкаОбороты.Организация,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ТочкаМаршрута,
	|	ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения.ДоговорКонтрагента.ОбособленныйУчетМногооботнойТары,
	|	ВТ_КоличествоВМесте.МногооборотнаяТара,
	|	ВЫБОР
	|		КОГДА &ВидОперации = ЗНАЧЕНИЕ(Перечисление.Базар_ВидыДвиженийМногооборотнойТары.Передача)
	|			ТОГДА ТранспортнаяЛогистикаДоставкаОбороты.ДокументДвижения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МногооборотнаяТара.Организация КАК Организация,
	|	ВТ_МногооборотнаяТара.МногооборотнаяТара КАК МногооборотнаяТара,
	|	СУММА(ВТ_МногооборотнаяТара.Количество) КАК Количество
	|ИЗ
	|	ВТ_МногооборотнаяТара КАК ВТ_МногооборотнаяТара
	|ГДЕ
	|	ВТ_МногооборотнаяТара.ОбособленныйУчетМногооботнойТары = ЛОЖЬ
	|	И ВТ_МногооборотнаяТара.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МногооборотнаяТара.Организация,
	|	ВТ_МногооборотнаяТара.МногооборотнаяТара
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_МногооборотнаяТара.Организация КАК Организация,
	|	ВТ_МногооборотнаяТара.Грузополучатель КАК Грузополучатель,
	|	ВТ_МногооборотнаяТара.Документ КАК Документ,
	|	ВТ_МногооборотнаяТара.МногооборотнаяТара КАК МногооборотнаяТара,
	|	СУММА(ВТ_МногооборотнаяТара.Количество) КАК Количество
	|ИЗ
	|	ВТ_МногооборотнаяТара КАК ВТ_МногооборотнаяТара
	|ГДЕ
	|	ВТ_МногооборотнаяТара.ОбособленныйУчетМногооботнойТары = ИСТИНА
	|	И ВТ_МногооборотнаяТара.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_МногооборотнаяТара.Организация,
	|	ВТ_МногооборотнаяТара.Грузополучатель,
	|	ВТ_МногооборотнаяТара.МногооборотнаяТара,
	|	ВТ_МногооборотнаяТара.Документ";
	
	ПакетЗапроса = Запрос.ВыполнитьПакет(); // 2 - на водителя, 3 - грузополучатели
	
	Если ЗаполнитьТаблицуНаВодителя тогда
		НаВодителя.Загрузить(ПакетЗапроса.Получить(2).Выгрузить());
	КонецЕсли;
	
	Если ЗаполнитьТаблицуГрузополучетели тогда
		Грузополучатели.Загрузить(ПакетЗапроса.Получить(3).Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиНаОснованииПоступленияТоваров()
	
	Если НЕ ЗначениеЗаполнено(Поставщик) ИЛИ
		 НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	СчетаМТ = МногооборотнаяТараСервер.СчетаМногооборотнойТары();
	Если НЕ МногооборотнаяТараСервер.ПредопределенныеСчетаУчетаМногооборотнойТарыЗаполнены(СчетаМТ) тогда
		Возврат;
	КонецЕсли;
	
	СчетаЗапасов = Новый Массив;
	СчетаЗапасов.Добавить(СчетаМТ.МногооборотнаяТараПоставщики);
	
	НомерСубконтоПоставщика = 0;
	НомерСубконтоДокумента = 0;
	НомерСубконтоМногооборотнаяТара = 0;
	СчетчикСубконто = 0;
	ВидыСубконто = Новый Массив;
	Для Каждого Субконто Из СчетаМТ.МногооборотнаяТараПоставщики.ВидыСубконто Цикл
		
		СчетчикСубконто = СчетчикСубконто + 1;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ДокументОснование)) тогда
			НомерСубконтоДокумента = СчетчикСубконто;
		КонецЕсли;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(Поставщик)) тогда
			НомерСубконтоПоставщика = СчетчикСубконто;
		КонецЕсли;
		
		Если Субконто.ВидСубконто.ТипЗначения.СодержитТип(Тип("СправочникСсылка.Номенклатура")) тогда
			НомерСубконтоМногооборотнаяТара = СчетчикСубконто;
		КонецЕсли;
		
		ВидыСубконто.Добавить(Субконто.ВидСубконто);
		
	КонецЦикла;
	
	Если НомерСубконтоПоставщика = 0
	 ИЛИ НомерСубконтоДокумента = 0
	 ИЛИ НомерСубконтоМногооборотнаяТара = 0 тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Дата));
	Запрос.УстановитьПараметр("Поставщик"   , Поставщик);
	Запрос.УстановитьПараметр("Документ"    , ДокументОснование.Ссылка);
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("СчетаЗапасов", СчетаЗапасов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиНаСкладе.Организация КАК Организация,
	|	ОстаткиНаСкладе.Субконто" + НомерСубконтоМногооборотнаяТара + " КАК МногооборотнаяТара,
	|	СУММА(ЕСТЬNULL(ОстаткиНаСкладе.КоличествоОстатокКт, 0)) КАК Количество
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&ДатаОстатков,
	|			Счет В (&СчетаЗапасов),
	|			&ВидыСубконто,
	|			Субконто" + НомерСубконтоПоставщика + " = &Поставщик
	|				И Субконто" + НомерСубконтоДокумента + " = &Документ) КАК ОстаткиНаСкладе
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНаСкладе.Организация,
	|	ОстаткиНаСкладе.Субконто" + НомерСубконтоМногооборотнаяТара + "";
	
	НаВодителя.Загрузить(Запрос.Выполнить().Выгрузить());
	Грузополучатели.Очистить();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Передача
	 ИЛИ ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Прием тогда
		Если НЕ ЗначениеЗаполнено(ДокументОснование) тогда
			Маршрут = ПредопределенноеЗначение("Справочник.Маршруты.ПустаяСсылка");
			Поставщик = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
			ВодительПолучатель = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.Перемещение тогда
		Маршрут = ПредопределенноеЗначение("Справочник.Маршруты.ПустаяСсылка");
		Поставщик = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		ДокументОснование = ПредопределенноеЗначение("Документ.МаршрутныйЛист.ПустаяСсылка");
	КонецЕсли;
	
	Если ВидОперации = Перечисления.Базар_ВидыДвиженийМногооборотнойТары.ВозвратПоставщику тогда
		Маршрут = ПредопределенноеЗначение("Справочник.Маршруты.ПустаяСсылка");
		Водитель = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
		Автомобиль = ПредопределенноеЗначение("Справочник.Автомобили.ПустаяСсылка");
		ВодительПолучатель = ПредопределенноеЗначение("Справочник.Водители.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры
